# PlanTopologySet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopologySet Constructor
PlanTopologySet Class See Also
---
Initializes a new instance of the PlanTopologySet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PlanTopologySet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PlanTopologySet()
```

# See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace